In [132]:
import pandas as pd

In [157]:
df=pd.read_csv("akay.csv")

In [158]:
df.head()

,Unnamed: 0.1,Unnamed: 0,customer,age,gender,merchant,amount,fraud,City,type,Card Type,Exp Type,oldbalanceOrg,oldbalanceDest,Date,newbalanceOrg,newbalanceDest
0,15784,15885,C1827331929,3,F,M348934600,3.88,0,Pune,CASH_IN,Signature,Grocery,35718.00,1346406.96,29-May-12,35714.12,1346410.84
1,6864,6911,C1275518867,5,F,M209847108,370.79,1,Srinagar,CASH_OUT,Silver,Grocery,37870.00,4997.62,27-Sep-12,37499.21,5368.41
2,4854,4891,C1434797923,3,M,M1198415165,96.63,1,Bengaluru,CASH_IN,Silver,Grocery,10500000.00,283806.11,17-Nov-13,10499903.37,283902.74
3,17714,17829,C1439880421,4,F,M1823072687,17.22,0,Panchkula,CASH_OUT,Signature,Grocery,68778.00,2438979.23,04-Mar-13,68760.78,2438996.45
4,48809,49108,C688652575,2,M,M348934600,83.91,0,Hyderabad,PAYMENT,Signature,Grocery,67768.63,7227334.26,23-Sep-13,67684.72,7227418.17

In [159]:
df["Exp Type"].value_counts()

Bills            20576
Travel           15801
Grocery           9889
Food              7048
Entertainment     2159
Fuel              1364
Name: Exp Type, dtype: int64

In [136]:
df.shape

(56839, 16)

In [161]:
df["Card Type"].value_counts()

Gold         14804
Silver       14243
Signature    14217
Platinum     13573
Name: Card Type, dtype: int64

In [138]:
total_record=56839

In [139]:
import pandas as pd
import numpy as np

# Create a DataFrame with the provided data
data = {
    'Exp Type': ['Grocery', 'Entertainment', 'Fuel', 'Food', 'Bills', 'Travel'],
    'Records': [10403, 10232, 11570, 11946, 11072, 1616]
}

df = pd.DataFrame(data)

# Calculate the total number of records
total_records = df['Records'].sum()

# Calculate the desired number of records for each category
desired_records = {
    'Bills': int(total_records * 0.362),
    'Grocery': int(total_records * 0.174),
    'Food': int(total_records * 0.124),
    'Travel': int(total_records * 0.278),
    'Fuel': int(total_records * 0.024),
    'Entertainment': int(total_records * 0.038)
}

# Change the number of records for each category
for index, row in df.iterrows():
    exp_type = row['Exp Type']
    df.at[index, 'Records'] = desired_records[exp_type]

# Normalize the records to ensure they add up to the total
total_normalized = df['Records'].sum()
factor = total_records / total_normalized

for index, row in df.iterrows():
    df.at[index, 'Records'] = int(row['Records'] * factor)

# Shuffle the DataFrame to randomly distribute the records
df = df.sample(frac=1).reset_index(drop=True)

# Load the original data
original_data = pd.read_csv("ak.csv")

# Create a new DataFrame with modified 'Exp Type' column
modified_data = pd.DataFrame(columns=original_data.columns)

for index, row in df.iterrows():
    exp_type = row['Exp Type']
    records = row['Records']
    modified_data = pd.concat([modified_data, original_data[original_data['Exp Type'] == exp_type].sample(n=records, replace=True)])

# Save the modified data to a new CSV file

In [141]:
df=modified_data

In [142]:
df.head()

,Unnamed: 0,customer,age,gender,merchant,amount,fraud,City,type,Card Type,Exp Type,oldbalanceOrg,oldbalanceDest,Date,newbalanceOrg,newbalanceDest
15784,15885,C1827331929,3,F,M348934600,3.88,0,Pune,CASH_IN,Signature,Grocery,35718.00,1346406.96,29-May-12,35714.12,1346410.84
6864,6911,C1275518867,5,F,M209847108,370.79,1,Srinagar,CASH_OUT,Silver,Grocery,37870.00,4997.62,27-Sep-12,37499.21,5368.41
4854,4891,C1434797923,3,M,M1198415165,96.63,1,Bengaluru,CASH_IN,Silver,Grocery,10500000.00,283806.11,17-Nov-13,10499903.37,283902.74
17714,17829,C1439880421,4,F,M1823072687,17.22,0,Panchkula,CASH_OUT,Signature,Grocery,68778.00,2438979.23,04-Mar-13,68760.78,2438996.45
48809,49108,C688652575,2,M,M348934600,83.91,0,Hyderabad,PAYMENT,Signature,Grocery,67768.63,7227334.26,23-Sep-13,67684.72,7227418.17

In [146]:
df["Exp Type"].value_counts()
df.to_csv("akay.csv")

In [163]:
df["Card Type"].value_counts()

Gold         14804
Silver       14243
Signature    14217
Platinum     13573
Name: Card Type, dtype: int64

In [164]:

# Create a DataFrame with the provided data for 'Card Type'
card_data = {
    'Card Type': ['Gold', 'Silver', 'Signature', 'Platinum'],
    'Records': [14804, 14243, 14217, 13573]
}

df_card = pd.DataFrame(card_data)

# Calculate the total number of records for 'Card Type'
total_records_card = df_card['Records'].sum()

# Calculate the desired number of records for each 'Card Type' category
desired_records_card = {
    'Platinum': int(total_records_card * 0.167),
    'Signature': int(total_records_card * 0.114),
    'Silver': int(total_records_card * 0.437),
    'Gold': int(total_records_card * 0.282)
}

# Change the number of records for each 'Card Type' category
for index, row in df_card.iterrows():
    card_type = row['Card Type']
    df_card.at[index, 'Records'] = desired_records_card[card_type]

# Normalize the records for 'Card Type' to ensure they add up to the total
total_normalized_card = df_card['Records'].sum()
factor_card = total_records_card / total_normalized_card

for index, row in df_card.iterrows():
    df_card.at[index, 'Records'] = int(row['Records'] * factor_card)

# Shuffle the DataFrame for 'Card Type' to randomly distribute the records
df_card = df_card.sample(frac=1).reset_index(drop=True)

# Load the original data
original_data = pd.read_csv("akay.csv")

# Create a new DataFrame with modified 'Card Type' column
modified_data = pd.DataFrame(columns=original_data.columns)

for index, row in df_card.iterrows():
    card_type = row['Card Type']
    records = row['Records']
    modified_data = pd.concat([modified_data, original_data[original_data['Card Type'] == card_type].sample(n=records, replace=True)])

# Save the modified data to a new CSV file

In [165]:
df=modified_data

In [166]:
df['Card Type'].value_counts()

Silver       24837
Gold         16028
Platinum      9491
Signature     6479
Name: Card Type, dtype: int64

In [167]:
df.head()

,Unnamed: 0.1,Unnamed: 0,customer,age,gender,merchant,amount,fraud,City,type,Card Type,Exp Type,oldbalanceOrg,oldbalanceDest,Date,newbalanceOrg,newbalanceDest
10029,50708,51016,C546697817,5,F,M348934600,25.31,0,Delhi,CASH_OUT,Signature,Food,47169.0,205879.66,05-Nov-11,47143.69,205904.97
18879,15627,15728,C465897830,4,M,M480139044,263.24,1,Delhi,PAYMENT,Signature,Travel,20143.0,2469789.14,21-Oct-11,19879.76,2470052.38
19118,51316,51633,C2125787399,4,F,M349281107,59.77,0,Jaipur,CASH_OUT,Signature,Travel,33819.0,414358.05,25-Feb-13,33759.23,414417.82
15997,37973,38204,C2118328869,2,F,M933210764,278.73,1,Lucknow,CASH_OUT,Signature,Food,14309.0,101846.02,12-Mar-14,14030.27,102124.75
14920,43551,43825,C1837200499,4,M,M980657600,958.53,1,Pandharpur,CASH_OUT,Signature,Food,54794.0,35507.81,16-Dec-12,53835.47,36466.34

In [169]:
df['type'].value_counts()

CASH_OUT    22336
CASH_IN     14159
PAYMENT     14134
TRANSFER     5806
DEBIT         400
Name: type, dtype: int64

In [99]:
df["Card Type"].value_counts()

Silver       24837
Gold         15573
Signature     9264
Platinum      6479
Mass           682
Name: Card Type, dtype: int64

In [155]:
df.drop(columns=['Unnamed: 0.1'], inplace=True)

In [172]:
df.head()
df.to_csv("ap.csv")

In [102]:
data=df

In [103]:
data.drop(columns=[columns[0]],inplace=True)

<class 'NameError'>: name 'columns' is not defined

In [105]:
df.to_csv("mohitl.csv")

In [51]:
df.drop(columns=[df.columns[0]], inplace=True)

In [52]:
df.head()

,age,gender,merchant,amount,fraud,City,type,Card Type,Exp Type,oldbalanceOrg,oldbalanceDest,Date,newbalanceOrg,newbalanceDest
48130,2,F,M732195782,7665.56,1.0,Bengaluru,PAYMENT,Silver,Entertainment,326905.0,1958851.25,22-Nov-12,319239.44,1966516.81
52780,3,M,M1823072687,12.2,0.0,Delhi,CASH_IN,Silver,Grocery,11106.0,599342.28,18-Oct-11,11093.80,599354.48
50849,2,F,M348934600,6.92,0.0,Pune,CASH_OUT,Silver,Food,74610.0,2008011.74,07-Apr-12,74603.08,2008018.66
48853,2,F,M1823072687,1.02,0.0,Koratla,CASH_IN,Silver,Entertainment,379.0,32114.18,27-May-12,377.98,32115.20
31914,2,M,M1823072687,29.24,0.0,Delhi,CASH_IN,Silver,Fuel,7757.0,1091280.93,12-Mar-13,7727.76,1091310.17

In [53]:
data.head()

,age,gender,merchant,amount,fraud,City,type,Card Type,Exp Type,oldbalanceOrg,oldbalanceDest,Date,newbalanceOrg,newbalanceDest
48130,2,F,M732195782,7665.56,1.0,Bengaluru,PAYMENT,Silver,Entertainment,326905.0,1958851.25,22-Nov-12,319239.44,1966516.81
52780,3,M,M1823072687,12.2,0.0,Delhi,CASH_IN,Silver,Grocery,11106.0,599342.28,18-Oct-11,11093.80,599354.48
50849,2,F,M348934600,6.92,0.0,Pune,CASH_OUT,Silver,Food,74610.0,2008011.74,07-Apr-12,74603.08,2008018.66
48853,2,F,M1823072687,1.02,0.0,Koratla,CASH_IN,Silver,Entertainment,379.0,32114.18,27-May-12,377.98,32115.20
31914,2,M,M1823072687,29.24,0.0,Delhi,CASH_IN,Silver,Fuel,7757.0,1091280.93,12-Mar-13,7727.76,1091310.17

In [55]:
data['Exp Type'].value_counts()

Food             12375
Fuel             11135
Bills            11015
Grocery          10549
Entertainment    10082
Travel            1679
Name: Exp Type, dtype: int64

In [56]:
df['Exp Type'].value_counts()

Food             12375
Fuel             11135
Bills            11015
Grocery          10549
Entertainment    10082
Travel            1679
Name: Exp Type, dtype: int64